ELPasEDT/src/Reports/ОтчетОбИспользованииРеагентоов/ОтчетОбИспользованииРеагентоов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетОбИспользованииРеагентоов</name>
  <attributes>
    <name>ДокументПриемаСмены</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </attributes>
</mdclass:Report>

ELPasEDT/src/Documents/ЗаписьЖурналаУчетаРеагентов/ЗаписьЖурналаУчетаРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписьЖурналаУчетаРеагентов</name>
  <registerRecords>InformationRegister.РаботаХимцеха</registerRecords>
  <registerRecords>AccumulationRegister.ИспользованиеРеагентов</registerRecords>
  <registerRecords>AccumulationRegister.РеагентыВПодразделениях</registerRecords>
  <registerRecords>InformationRegister.УровеньРаствораВМернике</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ВахтаНачалаЗакачки</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВахтаНачалаРасхода</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВахтаОкончанияЗакачки</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВахтаОкончанияРасхода</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаЗакачки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРасхода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЗакачки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРасхода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий3</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий4</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияНаНачалоЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияНаНачалоРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияНаОкончаниеЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияНаОкончаниеРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияПоДокументам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемСработанногоРаствораЗакачка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемСработанногоРаствораРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйНачалаЗакачки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйНачалаРасхода</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОкончанияЗакачки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОкончанияРасхода</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлотностьПоТаблицам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасходТоварногоРеагента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаНачалаЗакачки</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаНачалаРасхода</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаОкончанияЗакачки</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаОкончанияРасхода</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньНаНачалоЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньНаНачалоРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньНаОкончаниеЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньНаОкончаниеРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияКоличества</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияКонцентрации</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПлотности</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходРеагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасхода</name>
    <type>
      <types>CatalogRef.ВидыРасходаРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеРасхода</name>
    <type>
      <types>CatalogRef.НаправленияРасходаРеагентов</types>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакачкаНачата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакачкаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходНачат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьОтменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитатьРасходВоВремяЗакачки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЧистогоРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЧистогоРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЧистойЗакачки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЧистогоРасхода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВключатьВЖурнал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПриемаСмены</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийАвтрораИзменений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Корректировки</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ELPasEDT/src/Reports/ОтчетОбИспользованииРеагентоов/ObjectModule.bsl
Функция Сформировать() Экспорт
	
	Макет = ПолучитьМакет("ОтчетОбИспользованииРеагентоов");
	
	ОбластьЗаголовок    = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока       = Макет.ПолучитьОбласть("Строка");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	ТабДок = Новый ТекстовыйДокумент;
	ОбластьЗаголовок.Параметры.Дата  = ДокументПриемаСмены.ДатаСобытия;
	ОбластьЗаголовок.Параметры.Смена = ДокументПриемаСмены.Смена;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаписьЖурналаУчетаРеагентов.Ссылка КАК Ссылка,
	|	ЗаписьЖурналаУчетаРеагентов.ВерсияДанных КАК ВерсияДанных,
	|	ЗаписьЖурналаУчетаРеагентов.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗаписьЖурналаУчетаРеагентов.Номер КАК Номер,
	|	ЗаписьЖурналаУчетаРеагентов.Дата КАК Дата,
	|	ЗаписьЖурналаУчетаРеагентов.Проведен КАК Проведен,
	|	ЗаписьЖурналаУчетаРеагентов.Организация КАК Организация,
	|	ЗаписьЖурналаУчетаРеагентов.Подразделение КАК Подразделение,
	|	ЗаписьЖурналаУчетаРеагентов.Оборудование КАК Оборудование,
	|	ЗаписьЖурналаУчетаРеагентов.ВахтаНачалаЗакачки КАК ВахтаНачалаЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ВахтаНачалаРасхода КАК ВахтаНачалаРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ВахтаОкончанияЗакачки КАК ВахтаОкончанияЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ВахтаОкончанияРасхода КАК ВахтаОкончанияРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ВидРеагента КАК ВидРеагента,
	|	ЗаписьЖурналаУчетаРеагентов.ВремяЗакачки КАК ВремяЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ВремяРасхода КАК ВремяРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ДатаНачалаЗакачки КАК ДатаНачалаЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ДатаНачалаРасхода КАК ДатаНачалаРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ДатаОкончанияЗакачки КАК ДатаОкончанияЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ДатаОкончанияРасхода КАК ДатаОкончанияРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.Комментарий1 КАК Комментарий1,
	|	ЗаписьЖурналаУчетаРеагентов.Комментарий2 КАК Комментарий2,
	|	ЗаписьЖурналаУчетаРеагентов.Комментарий3 КАК Комментарий3,
	|	ЗаписьЖурналаУчетаРеагентов.Комментарий4 КАК Комментарий4,
	|	ЗаписьЖурналаУчетаРеагентов.КонцентрацияНаНачалоЗакачки КАК КонцентрацияНаНачалоЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.КонцентрацияНаНачалоРасхода КАК КонцентрацияНаНачалоРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.КонцентрацияНаОкончаниеЗакачки КАК КонцентрацияНаОкончаниеЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.КонцентрацияНаОкончаниеРасхода КАК КонцентрацияНаОкончаниеРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.КонцентрацияПоДокументам КАК КонцентрацияПоДокументам,
	|	ЗаписьЖурналаУчетаРеагентов.ОбъемСработанногоРаствораЗакачка КАК ОбъемСработанногоРаствораЗакачка,
	|	ЗаписьЖурналаУчетаРеагентов.ОбъемСработанногоРаствораРасход КАК ОбъемСработанногоРаствораРасход,
	|	ЗаписьЖурналаУчетаРеагентов.ОтветственныйНачалаЗакачки КАК ОтветственныйНачалаЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ОтветственныйНачалаРасхода КАК ОтветственныйНачалаРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ОтветственныйОкончанияЗакачки КАК ОтветственныйОкончанияЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ОтветственныйОкончанияРасхода КАК ОтветственныйОкончанияРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ПлотностьПоТаблицам КАК ПлотностьПоТаблицам,
	|	ЗаписьЖурналаУчетаРеагентов.Расход КАК Расход,
	|	ЗаписьЖурналаУчетаРеагентов.РасходТоварногоРеагента КАК РасходТоварногоРеагента,
	|	ЗаписьЖурналаУчетаРеагентов.СменаНачалаЗакачки КАК СменаНачалаЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.СменаНачалаРасхода КАК СменаНачалаРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.СменаОкончанияЗакачки КАК СменаОкончанияЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.СменаОкончанияРасхода КАК СменаОкончанияРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.УровеньНаНачалоЗакачки КАК УровеньНаНачалоЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.УровеньНаНачалоРасхода КАК УровеньНаНачалоРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.УровеньНаОкончаниеЗакачки КАК УровеньНаОкончаниеЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.УровеньНаОкончаниеРасхода КАК УровеньНаОкончаниеРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ЕдиницаИзмеренияКоличества КАК ЕдиницаИзмеренияКоличества,
	|	ЗаписьЖурналаУчетаРеагентов.ЕдиницаИзмеренияКонцентрации КАК ЕдиницаИзмеренияКонцентрации,
	|	ЗаписьЖурналаУчетаРеагентов.ЕдиницаИзмеренияПлотности КАК ЕдиницаИзмеренияПлотности,
	|	ЗаписьЖурналаУчетаРеагентов.Партия КАК Партия,
	|	ЗаписьЖурналаУчетаРеагентов.ВидРасхода КАК ВидРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.НаправлениеРасхода КАК НаправлениеРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.Реагент КАК Реагент,
	|	ЗаписьЖурналаУчетаРеагентов.РучнаяКорректировка КАК РучнаяКорректировка,
	|	ЗаписьЖурналаУчетаРеагентов.ЗакачкаНачата КАК ЗакачкаНачата,
	|	ЗаписьЖурналаУчетаРеагентов.ЗакачкаЗавершена КАК ЗакачкаЗавершена,
	|	ЗаписьЖурналаУчетаРеагентов.РасходНачат КАК РасходНачат,
	|	ЗаписьЖурналаУчетаРеагентов.РасходЗавершен КАК РасходЗавершен,
	|	ЗаписьЖурналаУчетаРеагентов.ЗаписьОтменена КАК ЗаписьОтменена,
	|	ЗаписьЖурналаУчетаРеагентов.РассчитатьРасходВоВремяЗакачки КАК РассчитатьРасходВоВремяЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ВремяЧистогоРасхода КАК ВремяЧистогоРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ОбъемЧистогоРасхода КАК ОбъемЧистогоРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ДатаОкончанияЧистойЗакачки КАК ДатаОкончанияЧистойЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ДатаОкончанияЧистогоРасхода КАК ДатаОкончанияЧистогоРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.НеВключатьВЖурнал КАК НеВключатьВЖурнал,
	|	ЗаписьЖурналаУчетаРеагентов.ДокументПриемаСмены КАК ДокументПриемаСмены,
	|	ЗаписьЖурналаУчетаРеагентов.КомментарийАвтрораИзменений КАК КомментарийАвтрораИзменений
	|ИЗ
	|	Документ.ЗаписьЖурналаУчетаРеагентов КАК ЗаписьЖурналаУчетаРеагентов
	|ГДЕ
	|	ЗаписьЖурналаУчетаРеагентов.ДокументПриемаСмены = &ДокументПриемаСмены
	|	И ЗаписьЖурналаУчетаРеагентов.Проведен
	|	И НЕ ЗаписьЖурналаУчетаРеагентов.ЗаписьОтменена
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаписьЖурналаУчетаРеагентов.Дата
	|ИТОГИ ПО
	|	ВидРеагента");
	Запрос.УстановитьПараметр("ДокументПриемаСмены", ДокументПриемаСмены);
	
	ВыборкаВидРеагента = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидРеагента.Следующий() Цикл
		
		ОбластьШапкаТаблицы.Параметры.ВидРеагента = ВыборкаВидРеагента.ВидРеагента;
		ТабДок.Вывести(ОбластьШапкаТаблицы);
		
		Выборка = ВыборкаВидРеагента.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ЗаполнитьПараметрыСтрокиОтчета(Выборка, ОбластьСтрока, "НАЧАЛО");
			ЗаполнитьПараметрыСтрокиОтчета(Выборка, ОбластьСтрока, "ОКОНЧАНИЕ");
			
			ТабДок.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьПустаяСтрока);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Процедура ЗаполнитьПараметрыСтрокиОтчета(Выборка, ОбластьСтрока, Операция)

	ОчиститьПараметрыСтроки(ОбластьСтрока);
	
	//Оборудование
	
	Если Операция = "НАЧАЛО" Тогда
		
		ОбластьСтрока.Параметры.Ооборудование	         = Выборка.Оборудование;
		ОбластьСтрока.Параметры.ВремяРасхода	         = Выборка.ДатаНачалаРасхода;
		ОбластьСтрока.Параметры.ВидНапр	                 = ?(ЗначениеЗаполнено(Выборка.НаправлениеРасхода), Выборка.НаправлениеРасхода, Выборка.ВидРасхода);
		ОбластьСтрока.Параметры.ОтвРасоход	             = Выборка.ОтветственныйНачалаРасхода;
		ОбластьСтрока.Параметры.ДлительностьРасоход	     = Выборка.ВремяРасхода;
		ОбластьСтрока.Параметры.УровеньРасход	         = Выборка.КонцентрацияНаНачалоРасхода;
		ОбластьСтрока.Параметры.КонцентрацияРасход	     = Выборка.КонцентрацияНаНачалоРасхода;
		ОбластьСтрока.Параметры.ОбъемСработанногоРасход	 = Выборка.ОбъемСработанногоРаствораРасход;
		ОбластьСтрока.Параметры.ВремяЗакачка	         = Выборка.ДатаНачалаЗакачки;
		ОбластьСтрока.Параметры.ОтвЗакачка	             = Выборка.ОтветственныйНачалаЗакачки;
		ОбластьСтрока.Параметры.ДлмтельностьЗакачка	     = Выборка.ВремяЗакачки;
		ОбластьСтрока.Параметры.УровеньЗакачка	         = Выборка.УровеньНаНачалоЗакачки;
		ОбластьСтрока.Параметры.КонцентрацияЗакачка	     = Выборка.КонцентрацияНаНачалоЗакачки;
		ОбластьСтрока.Параметры.ОбъемСработанногоЗакачка = Выборка.ОбъемСработанногоРаствораЗакачка;
		ОбластьСтрока.Параметры.Расход	                 = Выборка.Расход;
		ОбластьСтрока.Параметры.Партия                   = Выборка.Партия;
		
	ИначеЕсли Операция = "ОКОНЧАНИЕ" Тогда
		
		ОбластьСтрока.Параметры.УровеньРасход	         = Выборка.УровеньНаОкончаниеРасхода;
		ОбластьСтрока.Параметры.КонцентрацияРасход	     = Выборка.КонцентрацияНаОкончаниеРасхода;
		
		ОбластьСтрока.Параметры.УровеньЗакачка	         = Выборка.УровеньНаОкончаниеЗакачки;
		ОбластьСтрока.Параметры.КонцентрацияЗакачка	     = Выборка.КонцентрацияНаОкончаниеЗакачки;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОчиститьПараметрыСтроки(ОбластьСтрока)

	ОбластьСтрока.Параметры.Ооборудование	         = Неопределено;
	ОбластьСтрока.Параметры.ВремяРасхода	         = Неопределено;
	ОбластьСтрока.Параметры.ВидНапр	                 = Неопределено;
	ОбластьСтрока.Параметры.ОтвРасоход	             = Неопределено;
	ОбластьСтрока.Параметры.ДлительностьРасоход	     = Неопределено;
	ОбластьСтрока.Параметры.УровеньРасход	         = Неопределено;
	ОбластьСтрока.Параметры.КонцентрацияРасход	     = Неопределено;
	ОбластьСтрока.Параметры.ОбъемСработанногоРасход	 = Неопределено;
	ОбластьСтрока.Параметры.ВремяЗакачка	         = Неопределено;
	ОбластьСтрока.Параметры.ОтвЗакачка	             = Неопределено;
	ОбластьСтрока.Параметры.ДлмтельностьЗакачка	     = Неопределено;
	ОбластьСтрока.Параметры.УровеньЗакачка	         = Неопределено;
	ОбластьСтрока.Параметры.КонцентрацияЗакачка	     = Неопределено;
	ОбластьСтрока.Параметры.ОбъемСработанногоЗакачка = Неопределено;
	ОбластьСтрока.Параметры.Расход	                 = Неопределено;
	ОбластьСтрока.Параметры.Партия                   = Неопределено;
	
КонецПроцедуры
